package prac.variable;

public class Var5 {
	public static void main(String[] args) {
		// 정수
		byte b = 127; // -128 ~ 127
		short s = 32767; // -32,768 ~ 32,767
		int i = 2147483647; // -2,147,483,648 ~ 2,147,483,647
		long l = 9223372036854775807L; // -9,223,372,036,854,775,808 ~ 9,223,372,036,854,775,807

		// 실수
		float f = 3.14f;
		double d = 3.14; // 정밀도가 더 높음

		// 메모리를 작게 사용하면 작은 숫자를 표현할 수 있고
		// 메모리를 많이 사용하면 큰 숫자를 표현할 수 있음

		// 메모리 용량은 매우 저렴하다. 따라서 메모리 용량을 약간 절약하기 보다는
		// 개발 속도나 효율에 초점을 맞추는 것이 더 효과적이다.
		
	}
}
