use mysql;

create database tdb;

-- $ mysql -u root -p"TestdbRoot" -h 127.0.0.1 -P 3308 tdb < testdb_data.sql

use tdb;
show triggers like 'Emp';

select * from Dept;
-- ============================================================
-- 사고 시나리오
-- ============================================================
-- 1. Full Backup 수행
-- 2. UPDATE 수행
-- 3. 실수로 DELETE 발생


-- ============================================================
-- Full Backup 이후 수행한 작업
-- ============================================================
-- 이 이후 작업은 binlog에 기록이 남음 (transaction log 성격)
update Dept set dname='모바일앱' where id = 10;

-- 실수로 삭제
delete from Dept where id > 7;



-- ============================================================
-- 복구 목표
-- ============================================================
-- UPDATE 까지는 살리고 
-- DELETE는 발생 전 상태로 복원


-- ============================================================
-- 복구 1단계: Full Backup 복구
-- ============================================================
-- mysql -u root -p"TestdbRoot" -h 127.0.0.1 -P 3308
-- 없어졌던 부서들이 돌아옴, 하지만 모바일앱이 아닌 모바일셀

-- ============================================================
-- 복구 2단계: binlog 분석
-- ============================================================

-- binlog → SQL 파일로 변환
-- mysqlbinlog mysql/binlog.000009 -v -d tdb > t.sql

-- t.sql 에서 확인
--  1) DELETE FROM 검색
--  2) 해당 DELETE 이전 BEGIN 시각 확인
--  3) Full Backup 생성 시각 확인

-- DELETE 발생 시간: 251210 14:10:14
-- Full Backup 시간 : 251210 14:09:39

-- binlog position 범위:
-- 49779 ~ 50104
-- (이 구간에 '모바일셀 → 모바일앱' UPDATE 포함)


-- ============================================================
-- 복구 3단계: 필요한 binlog 구간만 추출
-- ============================================================

-- mysqlbinlog --start-position=49779 --stop-position=50104 mysql/binlog.000009 -v -d tdb > t3.sql
-- vi t3.sql


-- ============================================================
-- 복구 4단계: 적용
-- ============================================================

-- mysql -u root -p"TestdbRoot" -h 127.0.0.1 -P 3308 tdb < t3.sql
-- 모바일셀 → 모바일앱 (변경 확인) 